MatteoOrlandini/SensorTile-Firmware-Bachelor-Thesis/STM32CubeFunctionPack_ALLMEMS1_V3.4.0/Drivers/BSP/BlueCoin/BlueCoin_prox.c
/**
******************************************************************************
* @file    BlueCoin_PROX.c
* @author  Central Labs
* @version V1.2.0
* @date    23-March-2018
* @brief   This file provides the range sensor driver
*        
******************************************************************************
* @attention
*
* <h2><center>&copy; COPYRIGHT(c) 2016 STMicroelectronics</center></h2>
*
* Redistribution and use in source and binary forms, with or without modification,
* are permitted provided that the following conditions are met:
*   1. Redistributions of source code must retain the above copyright notice,
*      this list of conditions and the following disclaimer.
*   2. Redistributions in binary form must reproduce the above copyright notice,
*      this list of conditions and the following disclaimer in the documentation
*      and/or other materials provided with the distribution.
*   3. Neither the name of STMicroelectronics nor the names of its contributors
*      may be used to endorse or promote products derived from this software
*      without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
* DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
* FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
* DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
* SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
* CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
* OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
* OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************
*/

/* Includes ------------------------------------------------------------------*/
#include "BlueCoin_prox.h"
#include "BlueCoin.h"


/** @addtogroup BSP
 * @{
 */

/** @addtogroup BlueCoin
 * @{
 */

/** @addtogroup BlueCoin_PROXIMITY
* @brief This file provides a set of firmware functions to manage MEMS range Sensor
 * @{
 */

#include "../../STM32F4xx_HAL_Driver/Inc/stm32f4xx_hal.h"
#include <string.h>

#define I2C_TIME_OUT_BASE   10
#define I2C_TIME_OUT_BYTE   1
#define VL53L0X_OsDelay(...) HAL_Delay(2)


#ifndef HAL_I2C_MODULE_ENABLED
#warning "HAL I2C module must be enable "
#endif

/* when not customized by application define dummy one */
#ifndef VL53L0X_GetI2cBus
/** This macro can be overloaded by user to enforce i2c sharing in RTOS context
 */
#   define VL53L0X_GetI2cBus(...) (void)0
#endif

#ifndef VL53L0X_PutI2cBus
/** This macro can be overloaded by user to enforce i2c sharing in RTOS context
 */
#   define VL53L0X_PutI2cBus(...) (void)0
#endif

#ifndef VL53L0X_OsDelay
#   define  VL53L0X_OsDelay(...) (void)0
#endif




/** @defgroup BlueCoin_PROXIMITY_Private_Variables 
 * @{
 */

static DrvContextTypeDef PROX_SensorHandle[ PROX_SENSORS_MAX_NUM ];
static PROX_Data_t PROX_Data[ PROX_SENSORS_MAX_NUM ];
static VL53L0X_Data_t PROX_X_0_Data;
static VL53L0X_Data_t PROX_X_1_Data;
static uint8_t _I2CBuffer[64];
static VL53L0X_MODE_t old_mode[PROX_SENSORS_MAX_NUM];

/**
 * @}
 */

/** @defgroup BlueCoin_PROXIMITY_Private_Function_Prototypes 
 * @{
 */

static DrvStatusTypeDef BSP_VL53L0X_PROX_Init(PROX_ID_t id, void **handle );
static DrvStatusTypeDef VL53L0X_Init( DrvContextTypeDef *handle );
static DrvStatusTypeDef VL53L0X_Set_RangingProfile( DrvContextTypeDef *handle, uint8_t value );
static DrvStatusTypeDef VL53L0X_Set_RangingProfile( DrvContextTypeDef *handle, uint8_t value );
static DrvStatusTypeDef VL53L0X_Set_Device_Mode( DrvContextTypeDef *handle, uint8_t value );
static DrvStatusTypeDef VL53L0X_Get_RangeStatus( DrvContextTypeDef *handle, uint8_t *value );
static DrvStatusTypeDef VL53L0X_Get_LeakyRange( DrvContextTypeDef *handle, int *value );
static void Sensor_SetNewRange(VL53L0X_Dev_t *pDev, VL53L0X_RangingMeasurementData_t *pRange);
static void BSP_VL53L0X_SetAddress( DrvContextTypeDef *handle, uint8_t newAddress);


/**
 * @}
 */

/** @defgroup BlueCoin_PROXIMITY_Imported_Function_Prototypes 
 * @{
 */

/* Sensor IO functions */
extern DrvStatusTypeDef Sensor_IO_Init( void );
extern DrvStatusTypeDef Sensor_IO_Write( void *handle, uint8_t WriteAddr, uint8_t *pBuffer, uint16_t nBytesToWrite );
extern DrvStatusTypeDef Sensor_IO_Read(void *handle, uint8_t ReadAddr, uint8_t *pBuffer, uint16_t nBytesToRead);
extern I2C_HandleTypeDef    I2C_ONBOARD_SENSORS_Handle;
extern volatile uint8_t IT_I2C_error_af;

/**
 * @}
 */

/** @defgroup BlueCoin_PROXIMITY_Public_Functions  
 * @{
 */

/**
 * @brief Initialize a range sensor
 * @param id the range sensor identifier
 * @param handle the device handle
 * @retval COMPONENT_OK in case of success
 * @retval COMPONENT_ERROR in case of failure
 */
DrvStatusTypeDef BSP_PROX_Init( PROX_ID_t id, void **handle )
{
  *handle = NULL;
  
  switch(id)
  {
    case PROX_SENSORS_AUTO:
    default:
    {
      if( BSP_VL53L0X_PROX_Init(VL53L0X_0, handle) == COMPONENT_ERROR )
      {
        return COMPONENT_ERROR;
      }
      break;
    }
    case VL53L0X_0:
    {
      if( BSP_VL53L0X_PROX_Init(VL53L0X_0, handle) == COMPONENT_ERROR )
      {
        return COMPONENT_ERROR;
      }
      break;
    }
    case VL53L0X_1:
    {
      if( BSP_VL53L0X_PROX_Init(VL53L0X_1, handle) == COMPONENT_ERROR )
      {
        return COMPONENT_ERROR;
      }
      
      break;
    }
  }

  return COMPONENT_OK;
}

static DrvStatusTypeDef BSP_VL53L0X_PROX_Init(PROX_ID_t id, void **handle )
{
  
  if ( Sensor_IO_Init() == COMPONENT_ERROR )
  {
    return COMPONENT_ERROR;
  }
  
