MatteoOrlandini/SensorTile-Firmware-Bachelor-Thesis/STM32CubeFunctionPack_ALLMEMS1_V3.4.0/Drivers/BSP/BlueCoin/BlueCoin_prox.c
  switch(id)
  {
    case VL53L0X_1:
      // the U5 PROX must be initialize before U6 
      if(PROX_SensorHandle[ VL53L0X_1 ].isInitialized == 1 || (PROX_SensorHandle[ VL53L0X_0 ].isInitialized != 1))
      {
        return COMPONENT_ERROR;
      }
      
      //switch on the second PROX (U6)
      BSP_PROX_Pin_init();
      BSP_PROX_Pin_On();
      HAL_Delay(1);

      /* Setup sensor handle. */
      PROX_SensorHandle[ VL53L0X_1 ].who_am_i      = 0;
      PROX_SensorHandle[ VL53L0X_1 ].ifType        = 0;
      PROX_SensorHandle[ VL53L0X_1 ].address       = VL53L0X_ADDRESS_DEFAULT;
      PROX_SensorHandle[ VL53L0X_1 ].instance      = VL53L0X_1;
      PROX_SensorHandle[ VL53L0X_1 ].isInitialized = 0;
      PROX_SensorHandle[ VL53L0X_1 ].isEnabled     = 1;
      PROX_SensorHandle[ VL53L0X_1 ].isCombo       = 0;
      PROX_SensorHandle[ VL53L0X_1 ].pData         = ( void * )&PROX_Data[ VL53L0X_1 ];
      PROX_SensorHandle[ VL53L0X_1 ].pVTable       = NULL;
      PROX_SensorHandle[ VL53L0X_1 ].pExtVTable    = 0;
      
      PROX_Data[ VL53L0X_1 ].pComponentData = ( void * )&PROX_X_1_Data;
      PROX_Data[ VL53L0X_1 ].pExtData       = 0;
      
      *handle = (void *)&PROX_SensorHandle[ VL53L0X_1 ];
      
      break;
      
    case VL53L0X_0:
      if(PROX_SensorHandle[ VL53L0X_0 ].isInitialized == 1)
      {
        /* We have reached the max num of instance for this component */
        return COMPONENT_ERROR;
      }
      /* Setup sensor handle. */
      PROX_SensorHandle[ VL53L0X_0 ].who_am_i      = 0;
      PROX_SensorHandle[ VL53L0X_0 ].ifType        = 0;
      PROX_SensorHandle[ VL53L0X_0 ].address       = VL53L0X_ADDRESS_DEFAULT;
      PROX_SensorHandle[ VL53L0X_0 ].instance      = VL53L0X_0;
      PROX_SensorHandle[ VL53L0X_0 ].isInitialized = 0;
      PROX_SensorHandle[ VL53L0X_0 ].isEnabled     = 1;
      PROX_SensorHandle[ VL53L0X_0 ].isCombo       = 0;
      PROX_SensorHandle[ VL53L0X_0 ].pData         = ( void * )&PROX_Data[ VL53L0X_0 ];
      PROX_SensorHandle[ VL53L0X_0 ].pVTable       = NULL;
      PROX_SensorHandle[ VL53L0X_0 ].pExtVTable    = 0;
      
      PROX_Data[ VL53L0X_0 ].pComponentData = ( void * )&PROX_X_0_Data;
      PROX_Data[ VL53L0X_0 ].pExtData       = 0;
      
      *handle = (void *)&PROX_SensorHandle[ VL53L0X_0 ];
   
      break;
      
    default:
      return COMPONENT_ERROR;
  }
  
  if ( VL53L0X_Init( (DrvContextTypeDef *)(*handle) ) == COMPONENT_ERROR )
  {
    memset((*handle), 0, sizeof(DrvContextTypeDef));
    *handle = NULL;
    return COMPONENT_ERROR;
  }
  
  return COMPONENT_OK;
}

static DrvStatusTypeDef VL53L0X_Init( DrvContextTypeDef *handle )
{
    uint8_t Id=0x00;
    VL53L0X_Error status;
    uint8_t VhvSettings;
    uint8_t PhaseCal;
    uint32_t refSpadCount;
    uint8_t isApertureSpads;
    VL53L0X_Dev_t *pDev;

    pDev = (VL53L0X_Dev_t *)  &(((VL53L0X_Data_t *) ((PROX_Data_t *) ((DrvContextTypeDef *) handle)->pData)->pComponentData)->dev);
    pDev->Present = 0;     
    pDev->Id= (uint8_t)((DrvContextTypeDef *) handle)->instance;
    
    
    status=VL53L0X_RdByte(pDev, VL53L0X_REG_IDENTIFICATION_MODEL_ID,  &Id);
    
    if (IT_I2C_error_af == 1)
    {
      if(pDev->Id== VL53L0X_0)
      {
        BSP_VL53L0X_SetAddress(handle, VL53L0X_ADDRESS_U5);
      }
      else
      {
        BSP_VL53L0X_SetAddress(handle, VL53L0X_ADDRESS_U6);
      }
      
      Sensor_IO_Error();
           
      IT_I2C_error_af=0;
      /* Set I2C standard mode (400 KHz) before doing the first register access */
      status=VL53L0X_WrByte(pDev, 0x88, 0x00); 
    }
    else
    {
      status=VL53L0X_WrByte(pDev, 0x88, 0x00);
      
      status=VL53L0X_RdByte(pDev, VL53L0X_REG_IDENTIFICATION_MODEL_ID,  &Id);
      if(status == VL53L0X_ERROR_NONE)
      {
        
        if(pDev->Id== VL53L0X_0)
        {
          status = VL53L0X_SetDeviceAddress(pDev, VL53L0X_ADDRESS_U5);
        }
        else
        {
          status = VL53L0X_SetDeviceAddress(pDev, VL53L0X_ADDRESS_U6);
        }
        
        if( status != VL53L0X_ERROR_NONE )
        {
          return COMPONENT_ERROR;
        }
      }
      
      if(pDev->Id== VL53L0X_0)
      {
        BSP_VL53L0X_SetAddress(handle, VL53L0X_ADDRESS_U5);
      }
      else
      {
        BSP_VL53L0X_SetAddress(handle, VL53L0X_ADDRESS_U6);
      }
      
    }
    
    HAL_Delay(3);
    
    status = VL53L0X_DataInit(pDev);
    if( status != VL53L0X_ERROR_NONE )
    {
      return COMPONENT_ERROR;
    }
    pDev->Present = 1;
    
    if( VL53L0X_StaticInit(pDev) != VL53L0X_ERROR_NONE )
    {
      return COMPONENT_ERROR;
    }
    
    if( VL53L0X_PerformRefCalibration(pDev, &VhvSettings, &PhaseCal)  != VL53L0X_ERROR_NONE )
    {
      return COMPONENT_ERROR;
    }
   
    if( VL53L0X_PerformRefSpadManagement(pDev, &refSpadCount, &isApertureSpads)  != VL53L0X_ERROR_NONE )
    {
      return COMPONENT_ERROR;
    }
    
    pDev->LeakyFirst=1;
    handle->isInitialized = 1;
    
    return COMPONENT_OK;
}

/**
 * @brief Set new address on handler level
 * @param handle the device handle
 * @param newAddress new address to be set
 */
static void BSP_VL53L0X_SetAddress( DrvContextTypeDef *handle, uint8_t newAddress)
{
    ((DrvContextTypeDef *)(handle))->address = newAddress;
}

/**
 * @brief Deinitialize a range sensor
 * @param handle the device handle
 * @retval COMPONENT_OK in case of success
 * @retval COMPONENT_ERROR in case of failure
 */
DrvStatusTypeDef BSP_PROX_DeInit( void **handle )
{
  DrvContextTypeDef *ctx = (DrvContextTypeDef *)(*handle);
  
  VL53L0X_Dev_t *dev;
  
  
  if(ctx == NULL)
  {
    return COMPONENT_ERROR;
  }
  
  dev = (VL53L0X_Dev_t *)  &(((VL53L0X_Data_t *) ((PROX_Data_t *) (ctx)->pData)->pComponentData)->dev);

  if(ctx ->isInitialized == 1)
  {
    VL53L0X_StopMeasurement(dev);
    
    VL53L0X_ResetDevice(dev);
    
    VL53L0X_SetPowerMode(dev, VL53L0X_POWERMODE_IDLE_LEVEL1);
    
    if(ctx->instance == VL53L0X_1)
    {
      //switch off the second PROX (U6)
      BSP_PROX_Pin_Off();

      HAL_Delay(5);
     }
    ctx->isInitialized = 0;

