MatteoOrlandini/SensorTile-Firmware-Bachelor-Thesis/STM32CubeFunctionPack_ALLMEMS1_V3.4.0/Drivers/BSP/BlueCoin/BlueCoin_prox.c
  }
  else
  {
    return COMPONENT_ERROR;
  }
  
  memset(ctx, 0, sizeof(DrvContextTypeDef));
  
  *handle = NULL;
  
  return COMPONENT_OK;
}



/**
 * @brief Enable range sensor
 * @param handle the device handle
 * @retval COMPONENT_OK in case of success
 * @retval COMPONENT_ERROR in case of failure
 */
DrvStatusTypeDef BSP_PROX_Sensor_Enable( void *handle )
{
  DrvContextTypeDef *ctx = (DrvContextTypeDef *)handle;
  uint8_t status;
  

  if(ctx == NULL)
  {
    return COMPONENT_ERROR;
  }
  
  BSP_PROX_IsEnabled(ctx, &status);
  if(status)
  {
    return COMPONENT_ERROR;
  }
  
  ctx->isEnabled=1;
  BSP_PROX_Set_DeviceMode(handle, old_mode[ctx->instance]);

  return COMPONENT_OK;
}



/**
 * @brief Disable range sensor
 * @param handle the device handle
 * @retval COMPONENT_OK in case of success
 * @retval COMPONENT_ERROR in case of failure
 */
DrvStatusTypeDef BSP_PROX_Sensor_Disable( void *handle )
{

  DrvContextTypeDef *ctx = (DrvContextTypeDef *)handle;
  uint8_t status;

  if(ctx == NULL)
  {
    return COMPONENT_ERROR;
  }
  
  BSP_PROX_IsEnabled(ctx, &status);
  if(!status)
  {
    return COMPONENT_ERROR;
  }
  
  ctx->isEnabled=0;
  BSP_PROX_Set_DeviceMode(handle, SINGLE);

  
  return COMPONENT_OK;
}


/**
 * @brief Check if the range sensor is initialized
 * @param handle the device handle
 * @param status the pointer to the initialization status
 * @retval COMPONENT_OK in case of success
 * @retval COMPONENT_ERROR in case of failure
 */
DrvStatusTypeDef BSP_PROX_IsInitialized( void *handle, uint8_t *status )
{
  DrvContextTypeDef *ctx = (DrvContextTypeDef *)handle;
  
  if(ctx == NULL)
  {
    return COMPONENT_ERROR;
  }
  
  if ( status == NULL )
  {
    return COMPONENT_ERROR;
  }
  
  *status = ctx->isInitialized;
  
  return COMPONENT_OK;
}


/**
 * @brief Check if the range sensor is enabled
 * @param handle the device handle
 * @param status the pointer to the enable status
 * @retval COMPONENT_OK in case of success
 * @retval COMPONENT_ERROR in case of failure
 */
DrvStatusTypeDef BSP_PROX_IsEnabled( void *handle, uint8_t *status )
{
  DrvContextTypeDef *ctx = (DrvContextTypeDef *)handle;
  
  if(ctx == NULL)
  {
    return COMPONENT_ERROR;
  }
  
  if ( status == NULL )
  {
    return COMPONENT_ERROR;
  }
  
  *status = ctx->isEnabled;
  
  return COMPONENT_OK;
}


/**
 * @brief Check if the range sensor is combo
 * @param handle the device handle
 * @param status the pointer to the combo status
 * @retval COMPONENT_OK in case of success
 * @retval COMPONENT_ERROR in case of failure
 */
DrvStatusTypeDef BSP_PROX_IsCombo( void *handle, uint8_t *status )
{
  DrvContextTypeDef *ctx = (DrvContextTypeDef *)handle;
  
  if(ctx == NULL)
  {
    return COMPONENT_ERROR;
  }
  
  if ( status == NULL )
  {
    return COMPONENT_ERROR;
  }
  
  *status = ctx->isCombo;
  
  return COMPONENT_OK;
}


/**
 * @brief Get the range sensor instance
 * @param handle the device handle
 * @param instance the pointer to the device instance
 * @retval COMPONENT_OK in case of success
 * @retval COMPONENT_ERROR in case of failure
 */
DrvStatusTypeDef BSP_PROX_Get_Instance( void *handle, uint8_t *instance )
{
  DrvContextTypeDef *ctx = (DrvContextTypeDef *)handle;
  
  if(ctx == NULL)
  {
    return COMPONENT_ERROR;
  }
  
  if ( instance == NULL )
  {
    return COMPONENT_ERROR;
  }
  
  *instance = ctx->instance;
  
  return COMPONENT_OK;
}

/**
 * @brief Start ranging measurement
 * @param handle the device handle
 * @retval COMPONENT_OK in case of success
 * @retval COMPONENT_ERROR in case of failure
 */
DrvStatusTypeDef BSP_PROX_Start_Measurement( void *handle)
{
  VL53L0X_Dev_t *pDev;
  uint8_t status;
  
  
  BSP_PROX_IsEnabled(handle, &status);
  if(!status)
  {
    return COMPONENT_ERROR;
  }
  
  pDev = (VL53L0X_Dev_t *)  &(((VL53L0X_Data_t *) ((PROX_Data_t *) ((DrvContextTypeDef *) handle)->pData)->pComponentData)->dev);
  VL53L0X_StartMeasurement(pDev);
  pDev->Ready=0;

  return COMPONENT_OK;
}

/**
 * @brief Get status flag on measurement ready
 * @param handle the device handle
 * @param pDataready pointer to the return variable
 * @retval COMPONENT_OK in case of success
 * @retval COMPONENT_ERROR in case of failure
 */
DrvStatusTypeDef BSP_PROX_Get_Measurement_DataReady( void *handle,uint8_t *pDataready)
{  
 VL53L0X_Dev_t *pDev;
 uint8_t status;
 
 
 BSP_PROX_IsEnabled(handle, &status);
 if(!status)
 {
   return COMPONENT_ERROR;
 }
 
 pDev = (VL53L0X_Dev_t *)  &(((VL53L0X_Data_t *) ((PROX_Data_t *) ((DrvContextTypeDef *) handle)->pData)->pComponentData)->dev);
 status= VL53L0X_GetMeasurementDataReady(pDev, pDataready);
 
 if(status != VL53L0X_ERROR_NONE)
   return COMPONENT_ERROR;
 
 return COMPONENT_OK;
}

/**
 * @brief Get the range value
 * @param handle the device handle
 * @param range pointer where the value is written [mm]
 * @retval COMPONENT_OK in case of success
 * @retval COMPONENT_ERROR in case of failure
 */
DrvStatusTypeDef BSP_PROX_Get_Range( void *handle, uint16_t *range )
{
  VL53L0X_Dev_t *pDev;
  uint8_t status;
  VL53L0X_RangingMeasurementData_t RangingMeasurementData;
  
  
  BSP_PROX_IsEnabled(handle, &status);
  if(!status)
  {
    return COMPONENT_ERROR;
  }
  pDev = (VL53L0X_Dev_t *)  &(((VL53L0X_Data_t *) ((PROX_Data_t *) ((DrvContextTypeDef *) handle)->pData)->pComponentData)->dev);
  
  /* Clear Interrupt */
  status = VL53L0X_ClearInterruptMask(pDev, 0);
  if( status )
  {
    return COMPONENT_ERROR;
  }
  /* Otherwise, get new sample data and store */
  status = VL53L0X_GetRangingMeasurementData(pDev, &RangingMeasurementData);
  if( status )
  {
    return COMPONENT_ERROR;
  }
  
  Sensor_SetNewRange(pDev,&RangingMeasurementData);
  pDev->Ready=1;
  
  (*range) = RangingMeasurementData.RangeMilliMeter;
  
  return COMPONENT_OK;
  
