MatteoOrlandini/SensorTile-Firmware-Bachelor-Thesis/STM32CubeFunctionPack_ALLMEMS1_V3.4.0/Drivers/BSP/BlueCoin/BlueCoin_prox.c
}

/**
 * @brief Get the current ranging profile 
 * @param handle the device handle
 * @param status pointer to the destination variable
 * @retval COMPONENT_OK in case of success
 * @retval COMPONENT_ERROR in case of failure
 */
DrvStatusTypeDef BSP_PROX_Get_RangingProfile( void *handle, uint8_t *status )
{
  
  VL53L0X_Data_t *pData = (VL53L0X_Data_t *) ((DrvContextTypeDef *) handle) ->pData;
  
  if(pData == NULL)
  {
    return COMPONENT_ERROR;
  }
  
  (*status)=pData->profile;
  
  
  return COMPONENT_OK;

}

/**
 * @brief Set the current ranging profile 
 * @param handle the device handle
 * @param value should assume one of the following values
 *            @arg  VL53L0X_PROFILE_HIGH_SPEED
 *            @arg  VL53L0X_PROFILE_HIGH_ACCUR
 *            @arg  VL53L0X_PROFILE_LONG_RANGE
 * @retval COMPONENT_OK in case of success
 * @retval COMPONENT_ERROR in case of failure
 */
DrvStatusTypeDef BSP_PROX_Set_RangingProfile( void *handle, uint8_t value )
{

  DrvContextTypeDef *ctx = (DrvContextTypeDef *)handle;
  
  if(ctx == NULL)
  {
    return COMPONENT_ERROR;
  }


  if(value == VL53L0X_PROFILE_HIGH_SPEED || value == VL53L0X_PROFILE_HIGH_ACCUR || value == VL53L0X_PROFILE_LONG_RANGE )
  {
    if ( VL53L0X_Set_RangingProfile( ctx, value ) != COMPONENT_ERROR )
    {
      return COMPONENT_OK;
    }
  }
  
  return COMPONENT_ERROR;
}


static DrvStatusTypeDef VL53L0X_Set_RangingProfile( DrvContextTypeDef *handle, uint8_t value ){
  
  VL53L0X_Error status;
  
  VL53L0X_Dev_t *dev;
  uint8_t *p;
  
  uint8_t VhvSettings;
  uint8_t PhaseCal;

  FixPoint1616_t signalLimit = (FixPoint1616_t)(0.25*65536);
  FixPoint1616_t sigmaLimit = (FixPoint1616_t)(18*65536);
  uint32_t timingBudget = 33000;
  uint8_t preRangeVcselPeriod = 14;
  uint8_t finalRangeVcselPeriod = 10;
  
  dev = (VL53L0X_Dev_t *)  &(((VL53L0X_Data_t *) ((PROX_Data_t *) ((DrvContextTypeDef *) handle)->pData)->pComponentData)->dev);
  p = (uint8_t *)  &(((VL53L0X_Data_t *) ((PROX_Data_t *) ((DrvContextTypeDef *) handle)->pData)->pComponentData)->profile);
  *p=value;
  
  status = VL53L0X_SetLimitCheckEnable(dev, VL53L0X_CHECKENABLE_SIGMA_FINAL_RANGE, 1); // Enable Sigma limit
  if( status )
  {
    return COMPONENT_ERROR;
  }
  
  status = VL53L0X_SetLimitCheckEnable(dev, VL53L0X_CHECKENABLE_SIGNAL_RATE_FINAL_RANGE, 1); // Enable Signa limit
  if( status )
  {
    return COMPONENT_ERROR;
  }
  
  switch(value) 
  {
    case VL53L0X_PROFILE_LONG_RANGE:
      signalLimit = (FixPoint1616_t)(0.1*65536);
      sigmaLimit = (FixPoint1616_t)(60*65536);
      timingBudget = 33000;
      preRangeVcselPeriod = 18;
      finalRangeVcselPeriod = 14;
      break;
    case VL53L0X_PROFILE_HIGH_ACCUR:
      signalLimit = (FixPoint1616_t)(0.25*65536);
      sigmaLimit = (FixPoint1616_t)(18*65536);
      timingBudget = 200000;
      preRangeVcselPeriod = 14;
      finalRangeVcselPeriod = 10;
      break;
    case VL53L0X_PROFILE_HIGH_SPEED:
      signalLimit = (FixPoint1616_t)(0.25*65536);
      sigmaLimit = (FixPoint1616_t)(32*65536);
      timingBudget = 20000;
      preRangeVcselPeriod = 14;
      finalRangeVcselPeriod = 10;
      break;
    default:
      return COMPONENT_ERROR;
  }
  
  status = VL53L0X_SetLimitCheckValue(dev,  VL53L0X_CHECKENABLE_SIGNAL_RATE_FINAL_RANGE, signalLimit);
  if( status )
  {
    return COMPONENT_ERROR;
  }
  
  status = VL53L0X_SetLimitCheckValue(dev,  VL53L0X_CHECKENABLE_SIGMA_FINAL_RANGE, sigmaLimit);
  if( status )
  {
    return COMPONENT_ERROR;
  }
  
  status = VL53L0X_SetMeasurementTimingBudgetMicroSeconds(dev,  timingBudget);
  if( status )
  {
    return COMPONENT_ERROR;
  }
  
  status = VL53L0X_SetVcselPulsePeriod(dev,  VL53L0X_VCSEL_PERIOD_PRE_RANGE, preRangeVcselPeriod);
  if( status )
  {
    return COMPONENT_ERROR;
  }
  
  status = VL53L0X_SetVcselPulsePeriod(dev,  VL53L0X_VCSEL_PERIOD_FINAL_RANGE, finalRangeVcselPeriod);
  if( status )
  {
    return COMPONENT_ERROR;
  }
  
  status = VL53L0X_PerformRefCalibration(dev, &VhvSettings, &PhaseCal);
  if( status )
  {
    return COMPONENT_ERROR;
  }

  dev->LeakyFirst=1;
  
  return COMPONENT_OK;
}

/**
 * @brief Get the current device mode
 * @param handle the device handle
 * @param status pointer to the destination variable
 * @retval COMPONENT_OK in case of success
 * @retval COMPONENT_ERROR in case of failure
 */
DrvStatusTypeDef BSP_PROX_Get_Device_Mode( void *handle, uint8_t *status )
{
    VL53L0X_Dev_t *pDev;
    pDev = (VL53L0X_Dev_t *)  &(((VL53L0X_Data_t *) ((PROX_Data_t *) ((DrvContextTypeDef *) handle)->pData)->pComponentData)->dev);

    
    if( VL53L0X_GetDeviceMode(pDev, (uint8_t *) status) )
    {
      return COMPONENT_ERROR;
    }
    
    return COMPONENT_OK;
   
}

/**
 * @brief Set the current device mode
 * @param handle the device handle
 * @param value should assume one of the following values
 *            @arg  SINGLE
 *            @arg  CONTINUOUS
 * @retval COMPONENT_OK in case of success
 * @retval COMPONENT_ERROR in case of failure
 */
DrvStatusTypeDef BSP_PROX_Set_DeviceMode( void *handle, VL53L0X_MODE_t value )
{

  DrvContextTypeDef *ctx = (DrvContextTypeDef *) handle;
  
  if(ctx == NULL)
  {
    return COMPONENT_ERROR;
  }
  
  if (  value > TIMED )
  {
    return COMPONENT_ERROR;
  }

  if ( VL53L0X_Set_Device_Mode( ctx, value ) == COMPONENT_ERROR )
  {
    return COMPONENT_ERROR;
  }
  old_mode[ctx->instance]=value;
  
  return COMPONENT_OK;
}

static DrvStatusTypeDef VL53L0X_Set_Device_Mode( DrvContextTypeDef *handle, uint8_t value )
{

  VL53L0X_Dev_t *pDev;
  VL53L0X_Error status;
  pDev = (VL53L0X_Dev_t *)  &(((VL53L0X_Data_t *) ((PROX_Data_t *) ((DrvContextTypeDef *) handle)->pData)->pComponentData)->dev);
  
  if( pDev->Present){
    switch( (VL53L0X_MODE_t) value){
    case SINGLE :
      status = VL53L0X_SetDeviceMode(pDev, VL53L0X_DEVICEMODE_SINGLE_RANGING); // Setup in single ranging mode
      if( status )
      {
        return COMPONENT_ERROR;
      }
      break;
    case CONTINUOUS:
      status = VL53L0X_SetDeviceMode(pDev, VL53L0X_DEVICEMODE_CONTINUOUS_RANGING); // Setup in single ranging mode
      if( status )
      {
        return COMPONENT_ERROR;
      }
      break;
    case TIMED:
      return COMPONENT_NOT_IMPLEMENTED; /*interrupt pin is needed*/
 
    default:
      status = VL53L0X_SetDeviceMode(pDev, VL53L0X_DEVICEMODE_SINGLE_RANGING); // Setup in single ranging mode
      if( status )
      {
        return COMPONENT_ERROR;
      } 
    }
  }
  else
  {
    return COMPONENT_ERROR;
  }
  
  return COMPONENT_OK;
}

DrvStatusTypeDef BSP_PROX_Get_RangeStatus( void *handle, uint8_t *value )
{

