MatteoOrlandini/SensorTile-Firmware-Bachelor-Thesis/STM32CubeFunctionPack_ALLMEMS1_V3.4.0/Drivers/BSP/BlueCoin/BlueCoin_prox.c
  DrvContextTypeDef *ctx = (DrvContextTypeDef *)  handle;
  
  if(ctx == NULL)
  {
    return COMPONENT_ERROR;
  }
  
  
  if ( value == NULL )
  {
    return COMPONENT_ERROR;
  }

  if (VL53L0X_Get_RangeStatus( ctx, value ) == COMPONENT_ERROR )
  {
    return COMPONENT_ERROR;
  }
  
  return COMPONENT_OK;
  
}

static DrvStatusTypeDef VL53L0X_Get_RangeStatus( DrvContextTypeDef *handle, uint8_t *value ){
  
  VL53L0X_Dev_t *pDev;
  pDev = (VL53L0X_Dev_t *)  &(((VL53L0X_Data_t *) ((PROX_Data_t *) ((DrvContextTypeDef *) handle)->pData)->pComponentData)->dev);
  
  (*value) = pDev->RangeStatus;
  
  return COMPONENT_OK;
}

DrvStatusTypeDef BSP_PROX_Get_LeakyRange( void *handle, int *value )
{

  DrvContextTypeDef *ctx = (DrvContextTypeDef *)  handle;
  
  if(ctx == NULL)
  {
    return COMPONENT_ERROR;
  }
    
  if ( value == NULL )
  {
    return COMPONENT_ERROR;
  }

  if ( VL53L0X_Get_LeakyRange( ctx, value ) == COMPONENT_ERROR )
  {
    return COMPONENT_ERROR;
  }
  
  return COMPONENT_OK;
  
}

static DrvStatusTypeDef VL53L0X_Get_LeakyRange( DrvContextTypeDef *handle, int *value ){
  
  VL53L0X_Dev_t *pDev;
  pDev = (VL53L0X_Dev_t *)  &(((VL53L0X_Data_t *) ((PROX_Data_t *) ((DrvContextTypeDef *) handle)->pData)->pComponentData)->dev);
    
  (*value) = pDev->LeakyRange;
  return COMPONENT_OK;
}


/* Store new ranging data into the device structure, apply leaky integrator if needed */
static void Sensor_SetNewRange(VL53L0X_Dev_t *pDev, VL53L0X_RangingMeasurementData_t *pRange)
{
  int LeakyFactorFix8 = (int)( 0.0 *256);

    if( pRange->RangeStatus == 0 )
    {
    	pDev->RangeStatus = 0;
        if( pDev->LeakyFirst )
        {
            pDev->LeakyFirst = 0;
            pDev->LeakyRange = pRange->RangeMilliMeter;
        }
        else
        {
            pDev->LeakyRange = (pDev->LeakyRange*LeakyFactorFix8 + (256-LeakyFactorFix8)*pRange->RangeMilliMeter)>>8;
        }
    }
    else
    {
    	pDev->RangeStatus = pRange->RangeStatus;
    	pDev->LeakyFirst = 1;
    }
}


VL53L0X_Error VL53L0X_WriteMulti(VL53L0X_DEV Dev, uint8_t index, uint8_t *pdata, uint32_t count)
{
  
  if (count > sizeof(_I2CBuffer) - 1)
  {
    return VL53L0X_ERROR_INVALID_PARAMS;
  }
  
  if( Sensor_IO_Write( &PROX_SensorHandle[Dev->Id],  index, pdata, (uint16_t) count ) == COMPONENT_OK)
  {
    return VL53L0X_ERROR_NONE;
  }
  
  return VL53L0X_ERROR_CONTROL_INTERFACE;

}

VL53L0X_Error VL53L0X_ReadMulti(VL53L0X_DEV Dev, uint8_t index, uint8_t *pdata, uint32_t count)
{
  
  if (count > sizeof(_I2CBuffer) - 1)
  {
    return VL53L0X_ERROR_INVALID_PARAMS;
  }
  
  if( Sensor_IO_Read( &PROX_SensorHandle[Dev->Id],  index, pdata, (uint16_t) count ) == COMPONENT_OK)
  {
    return VL53L0X_ERROR_NONE;
  }
  
  return VL53L0X_ERROR_CONTROL_INTERFACE;

}

VL53L0X_Error VL53L0X_WrByte(VL53L0X_DEV Dev, uint8_t index, uint8_t data)
{

  if( Sensor_IO_Write( &PROX_SensorHandle[Dev->Id],  index, &data,1 ) == COMPONENT_OK)
  {
    return VL53L0X_ERROR_NONE;
  }
  
  return VL53L0X_ERROR_CONTROL_INTERFACE;

}

VL53L0X_Error VL53L0X_WrWord(VL53L0X_DEV Dev, uint8_t index, uint16_t data)
{
  
  _I2CBuffer[0] = data >> 8;
  _I2CBuffer[1] = data & 0x00FF;
  
  if( Sensor_IO_Write( &PROX_SensorHandle[Dev->Id],  index, _I2CBuffer, 2 ) == COMPONENT_OK)
  {    
    return VL53L0X_ERROR_NONE;
  }
 
  return VL53L0X_ERROR_CONTROL_INTERFACE;

}

VL53L0X_Error VL53L0X_WrDWord(VL53L0X_DEV Dev, uint8_t index, uint32_t data)
{
  
  _I2CBuffer[0] = (data >> 24) & 0xFF;
  _I2CBuffer[1] = (data >> 16) & 0xFF;
  _I2CBuffer[2] = (data >> 8)  & 0xFF;
  _I2CBuffer[3] = (data >> 0 ) & 0xFF;
  
  if( Sensor_IO_Write( &PROX_SensorHandle[Dev->Id],  index, _I2CBuffer, 4 ) == COMPONENT_OK)
  {    
    return VL53L0X_ERROR_NONE;
  }
  
  return VL53L0X_ERROR_CONTROL_INTERFACE;

}


VL53L0X_Error VL53L0X_UpdateByte(VL53L0X_DEV Dev, uint8_t index, uint8_t AndData, uint8_t OrData)
{
  VL53L0X_Error Status = VL53L0X_ERROR_NONE;
  uint8_t data;
  
  Status = VL53L0X_RdByte(Dev, index, &data);
  if (Status)
  {
    goto done;
  }
  data = (data & AndData) | OrData;
  Status = VL53L0X_WrByte(Dev, index, data);
done:
  return Status;
}

VL53L0X_Error VL53L0X_RdByte(VL53L0X_DEV Dev, uint8_t index, uint8_t *data)
{
  
  if( Sensor_IO_Read( &PROX_SensorHandle[Dev->Id],  index, data,1 ) == COMPONENT_OK)
  {
    return VL53L0X_ERROR_NONE;
  }
  
  return VL53L0X_ERROR_CONTROL_INTERFACE;

}


VL53L0X_Error VL53L0X_RdWord(VL53L0X_DEV Dev, uint8_t index, uint16_t *data)
{
  if( Sensor_IO_Read( &PROX_SensorHandle[Dev->Id],  index, _I2CBuffer, 2 ) == COMPONENT_OK)
  {
     *data = ((uint16_t)_I2CBuffer[0] << 8) + (uint16_t)_I2CBuffer[1];
  
    return VL53L0X_ERROR_NONE;
  }
  
  return VL53L0X_ERROR_CONTROL_INTERFACE;
  
}

VL53L0X_Error VL53L0X_RdDWord(VL53L0X_DEV Dev, uint8_t index, uint32_t *data)
{
  
  if( Sensor_IO_Read( &PROX_SensorHandle[Dev->Id],  index, _I2CBuffer, 4 ) == COMPONENT_OK)
  {
    *data = ((uint32_t)_I2CBuffer[0] << 24) + ((uint32_t)_I2CBuffer[1] << 16) + ((uint32_t)_I2CBuffer[2] << 8) +
          (uint32_t)_I2CBuffer[3];
  
    return VL53L0X_ERROR_NONE;
  }

  return VL53L0X_ERROR_CONTROL_INTERFACE;

}

VL53L0X_Error VL53L0X_PollingDelay(VL53L0X_DEV Dev)
{
  VL53L0X_Error status = VL53L0X_ERROR_NONE;
  
  // do nothing
  VL53L0X_OsDelay();

  return status;
}
/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */
 
 /**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
